'use client'

import { Container, Divider, Space, Text, Title } from '@mantine/core'

export default function AboutContent() {
  return (
    <Container size='lg' mt={65}>
      <Title order={3}>เกี่ยวกับเรา</Title>
      <Divider mt={5} />
      <Text fz={'sm'}>
        สเกตช์ ม้งแฟรนไชส์โมเดิร์นอุปัทวเหตุความหมาย เกรดสเก็ตช์กลาสโฮปเอฟเฟ็กต์ เช็งเม้งป๋อหลอโฟนเครปลีเมอร์ ฟลุคเทรนด์
        ดีพาร์ตเมนต์ ไอเดียไฮแจ็คริคเตอร์ออดิชั่น พลาซ่าสโรชาวิป ม้งสเตชันเลดี้เอ็นทรานซ์
        เซอร์ไพรส์บร็อคโคลีคำตอบเอ๋อคันยิ แม่ค้า ซังเตโฟนแฟร์หมวยเดอะ โอเพ่นดั๊มพ์โซนคันธาระ
        เพลย์บอยจิตเภทเทคโปรโมชั่นเมี่ยงคำ อันเดอร์ เจลก๋ากั่นดัมพ์แมชีน คอนเฟิร์มยอมรับซิตี้เซอร์ไพรส์ บุ๋น เจ๊แล็บ
        ติ่มซำแครอทคอนแทคคอร์ป เกรย์ราชบัณฑิตยสถานนินจา ทอมโบ้ยจีดีพีโอเคแอปเปิ้ล แดนเซอร์เมี่ยงคำ
        เอาท์ดอร์เพลย์บอยเทควันโดซาบะฮ่องเต้ แป๋วเสือโคร่งออยล์สแควร์ซินโดรม เป่ายิ้งฉุบเดบิตอัลมอนด์
        สตรอเบอร์รีคันยิไดเอ็ต คอนโดมิเนียมเตี๊ยมสตรอเบอร์รี ซังเตควิกฮาราคีรีคอนเซปต์ ก๋ากั่น สแตนเลสวิภัชภาค
        วัคค์อมาตยาธิปไตยพาร์ทเนอร์ เหี่ยวย่นวันเวย์แมมโบ้ โฟล์คอิกัวนาจิ๊กซอว์ออร์เดอร์ แบดแมมโบ้อิมพีเรียลออสซี่
        รูบิคมาร์ชพาวเวอร์ พาสต้าตู้เซฟไทม์โกลด์ แบนเนอร์กลาส ศึกษาศาสตร์เทคสปาสามช่า
        แมชชีนเพทนาการโฮลวีตเทเลกราฟอริยสงฆ์ ฮ็อตด็อกท็อปบูต แฟนตาซีสโตร์โยเกิร์ต อิสรชนโซลาร์ เมาท์สแควร์เทอร์โบ
        นรีแพทย์จิตพิสัยต่อยอดผิดพลาด อันเดอร์ธัมโมฟอยล์ เบอร์รีปิโตรเคมีซัพพลายเออร์ แครอทแจ็กพ็อตตี๋
        อวอร์ดแรงใจแคทวอล์คคอมเพล็กซ์โอเปอเรเตอร์ เบอร์รีเวิร์กเสือโคร่งเพทนาการช็อปเปอร์
        เซรามิกโอยัวะบร็อคโคลีเกมส์เจ็ต สต๊อกฟาสต์ฟู้ดเกรย์เซาท์ว้อดก้า นรีแพทย์ สตูดิโออินดอร์แพ็คตี๋
        แมกกาซีนซิมโฟนี่เซ็นเซอร์สเตชัน เทเลกราฟแบคโฮหล่อฮังก้วย เป็นไงอาว์เบนโลแอปเปิ้ล เฮียเลดี้ พูลรูบิกผิดพลาด
        คอรัปชันสะบึมส์เคอร์ฟิวสแควร์ โรลออนเวิลด์ ตรวจทาน มาร์เก็ตรวมมิตรไฟต์ดยุกภารตะ สโตร์ กุมภาพันธ์
        เฟรมมอลล์ลีเมอร์ โรลออนคีตปฏิภาณ วอลนัทเทรนด์อาร์พีจีเหี่ยวย่น สะบึมส์เฟิร์มเรตติ้งเอฟเฟ็กต์
        อ่อนด้อยยูวีอุปนายกคอรัปชันเครป โอเพ่นคองเกรสแคทวอล์คบร็อคโคลีพาสปอร์ต ไอซียูยอมรับสตาร์ทไคลแมกซ์มั้ง
        ช็อคเซรามิกแรลลี่อมาตยาธิปไตยกาญจนาภิเษก แบ็กโฮ ขั้นตอน เบอร์รีเทียมทาน ศึกษาศาสตร์กู๋คอนเซปต์ไชน่าสโลว์
        อิมพีเรียล เฟรมเรซิ่น ภควัมบดี
      </Text>
      <Space h='md' />
    </Container>
  )
}
